[
  {
    "id": "manasa-vacha-karmana-manasutho-mudi-padithe-ne-daani-bandham-antaru-adi-enni-mudulu-vesina-adi-opadam-ee",
    "title": "Manasa, vacha, karmana manasutho mudi padithe ne daani bandham antaru. Adi enni mudulu vesina, adi opadam ee?",
    "excerpt": "Manasa vacha karmana… kaani manasu ekkada?",
    "tags": [
      "Mahanati",
      "Madame bovary- 10 dec 2025"
    ],
    "image": "",
    "content": "Ah, Devadas… Gemini Ganesan ayite?\nPelli ayinavadu prema lo padithe, adi prema ki pariksha? Pelli ki pariksha?\n\nManasa, vacha, karmana manasutho mudi padithe ne daani bandham antaru. Adi enni mudulu vesina, adi opadam ee?\n\nMany of us enter marriage or relationships not from the heart, but from a checklist. It’s a calculation.\n \nWe often think of unions happening out of love, or that love happens after marriage, but mostly, marriage is oka pani.\nWe barter ourselves for status, money, ambition, fear of missing out and then glorify the bargain. Call it “enough.”\nPerhaps we cling to the hope that it might bloom into love, yet we forget the very real chance that it will not.\nIt becomes a contract of utility. Not prema, not longing. Just a compromise. Love is rarely the seed.\n\nWhen two souls are unable to stand alone, they bind themselves with duty and then call their chains sacred.\nSee Gemini Ganesan. His first marriage wasn’t love.\nHe sold himself into a contract at nineteen. He sold his youth to Alamelu’s father.\nThe commitment wasn’t to a person, but to a promise.\nAnd when that contract collapsed…\n\nWhat was left?\n\nOnce that sheen fades, you see the sweat, the boredom, the flaws, the insecurities.\nAnd finally, neeku artham avutundi the contract you entered isn’t just roses and poetry.\nIt’s also dishes, silence, irritation, and scars.\nThe curse of knowing too much about a person.\n\nYou face the raw human being before you.\nNot the fantasy. Not the performance. The truth.\nUgly and beauty dance side by side, like day and night locked in eternal being together.\n\nWhat holds it?\nDuty.\n\nThe hollow skeleton of fidelity.\nA partner without passion.\nA home without purpose.\nYou carry responsibility like a corpse on your shoulders.\n Your eyes burn red from rage at the lie of waking.\n\nInside that void, the mind whispers:\n“Oka sari ayina, true love kavali.”\nA perfect life.\n\nEvery breath tells you: I was not made for this.\nThis is not who I am.\nI deserve something truer, something more alive.\n“Reyi, idi nee jeevitham kaadu.”\n\nThis destructive entitlement the realisation that the foundational barter was unfair immediately creates a massive psychological debit.\nIt feels like justice to feel that way.\nLike self-rescue.\n\nNa tappu emi undi?\nIs it too much to ask for love?\n\nSomeone, something, owes me a perfect life.\nNot just an ordinary life but a perfect life.\nNot just companionship but true love.\n\nNenu deserving of that impossible love, that extravagant fantasy, that flawless redemption.\nWhen you try to reclaim happiness, it comes with high emotional intensity more like a necessary correction.\n \nGrieved entitlement justifies the pursuit of a magnificent delusion.\nYou scream that you’ve been robbed, but really, you’ve been pickpocketed not by life, but by your own illusions.\n\n\nSo enters Savitri.",
    "date": "2026-02-04"
  },
  {
    "id": "raalanni-poojinche-desham-lo-raathi-ni-preminchadam-thappu-ah-",
    "title": "Raalanni poojinche desham lo, raathi ni preminchadam thappu ah ?",
    "excerpt": "Waiting, Desperation, and the Illusion of Love",
    "tags": [],
    "image": "",
    "content": "We often believe love means having, keeping, securing that okkaru forever.\n\nBut life, Dostoevsky reminds us in White Nights, tells another story\nSometimes love is not possession, sometimes it is bearing witness to joy that excludes you.\nLove, in such moments, makes the mundane savage.\nBut asalu daani love anocha?\n\nLove, at times, hides beneath desperation.\nA desperate man is not only desperate to be desired, he is desperate to survive.\n\nLike okadu daggara dabbuu untey, hhinks ekkada manchi food tinali?\nAdhe okadu dabbuu lekpotey edo okati tinali.\nLoneliness works the same way.\nThe one who can bear it chooses carefully.\nThe one who cannot grab whatever will silence the emptiness.\n\nIt’s exhausting.\nIt is not hunger, it is not thirst.\nIt is the scream of an empty house, echoing louder than your own breath.\n\nAnd when you cross paths with someone, you cling to them not always because of love, but because you fear collapse without anyone by your side.\n\nSo we sugarcoat it, we call loneliness love.\nBecause it’s easier to say “nenu premisthunnanu” than to say “nenu ontarini”\nYou don’t want to admit to what desperation tastes like?\nSo you start calling it prema.\nBecause “love” is prettier.\n\nWho wants to admit\nI’m lonely, I’m starving, I would burn my skin just to feel someone else’s hand?\n\nTake Andala Rakshasi.\nDo not tell me it was about love.\n\nWe are here for Gowtham.\nAnd Gowtham?\n\nGowtham carved worship out of wounds, believing bleeding could become prayer.\nGowtham,\nMridhuna says she’ll wait. \nWho says to herself ? she’ll need time to let go of surya ? But how long before waiting becomes rot?\nshe was able to walk away from Surya, and believe her heart could still beat whole?\n\nBut how many days, how many nights will you wait before “waiting” becomes its own kind of death?\nThis isn’t about her.\nIt’s about you. If you were her, do you think you would ever move?\n\nDesperation makes us do holy things and sinful things.\nIt also makes us move on in order to survive, like in her case.\nIt makes us beg shadows to stay a little longer, like in your case.\nIt makes us leap off cliffs not from courage, but because falling feels like being held, if only for a second.\n\nTo every Gowtham out there\n\nWhat was driving you ? Mridhuna?\nOr the ache inside you, begging for a face to cover it?\n\nGowtham fantasized about Mridhuna not as his “ame na life lo leka pothey chachipothanu”, but as a way to stitch himself back together.\n\nThat is the danger of ressentiment \na man, unable to act, hides in imagination and sentiment, convincing himself his suffering is noble.\n\nEnta rojulu akalini prema peru tho daachukovali?\nGowtham, maybe enduku anta aakali?\n\nMaybe that’s not where you are supposed to be finding your healing.\nBut this resignation to an ugly sugarcoat called love is sad.\nIt is waiting for happiness to come from another’s kindness, instead of willing it into existence yourself.\n\nTo be free, one must not be content with them.\nEven pain, if willed, can become joy.\nBut passivity dressing wounds as worship, disguising loneliness as prema will forever make you small.\n\nSo stop living in cheekati.\n\nDo not cling to waiting.\n\nDo not worship desperation.\n\nSay yes to life, even when it wounds you.",
    "date": "2026-02-04"
  }
]